{
  "headings": {
    "description": "Beschreibung",
    "technologies": "Technologien",
    "purpose-and-goal": "Zweck & Zielsetzung",
    "tech-stack": "Verwendete Technologien",
    "challenges-and-problems": "Herausforderungen & Probleme",
    "conclusion": "Fazit"
  },
  "overview": {
    "p-1": "<0>Dieses Projekt ist etwas besonderes, da ich keine einzige Zeile Code geschrieben habe! Ich wollte mit dem Design Tool <1>Figma</1> besser werden, aber nicht einfach nur einem Tutorial folgen, sondern ein echtes Projekt bauen. Was mich dazu inspiriert hat, war dieses Video von <2>AJ&Smart</2>: <3>Figma UI Design Tutorial: Get Started in Just 24 Minutes! (2021)</3>. In diesem erklärt er nicht nur <4>Figma</4> selbst, sondern sagt auch, dass man am besten dadurch lernt, indem man andere Websites / Applikationen nachbaut. Aus diesem Grund habe ich beschlossen, einen Neuentwurf der <5>xkcd Website</5> vom Buchautor <6>Randall Munroe</6> anzufertigen, da ich ein großer Fan seiner Bücher <7>What If</7> und <8>How To</8> bin.</0>",
    "bullet-points": {
      "bp-1": "Designüberarbeitung für Website",
      "bp-2": "Nicht verfügbar"
    }
  },
  "purpose-and-goal": {
    "p-2": "<0>Mir fiel immer öfter auf, dass ich beim Ausprobieren von Struktur und Styling einer Website / Applikation sehr lange brauchte, da ich zuerst den entsprechenden Code und CSS dafür schreiben musste. Ein schneller Entwurf war selten möglich, wenn es um weniger triviale Dinge wie das umarrangieren mehrerer Komponenten ging. Nach ein wenig Recherche bin ich auf <1>Figma</1> gestoßen, welches ein sehr populäres und flexibles Design Tool ist, auch in der kostenlosen Variante.</0>",
    "p-3": "<0>Damit konnte ich in kurzer Zeit <1>Wireframes</1> erstellen, in denen ich zum Beispiel per Drag & Drop die Platzierung von Komponenten oder Schriftarten getestet habe. Der nächste Schritt war, aus dem Wireframe ein <2>Prototyp</2> zu erstellen, sodass man zum Beispiel durch klicken ein Menü öffnen kann.</0>",
    "p-4": "<0>Da ich aber meine Fähigkeiten mit einem \"echten\" Projekt verbessern wollte, hatte ich mich entschieden, einen Neuentwurf der <1>xkcd</1> Website zu machen. Diese ist (meiner Meinung nach) vom technischen und ästhetischen Aspekt etwas in der Zeit stecken geblieben. Mein Ziel war es, das Design radikal zu vereinfachen, die Benutzerführung zu verbessern, aber auch dem Stil von <2>Randall Munroe</2> treu zu bleiben.</0>"
  },
  "tech-stack": {
    "p-5": "<0>Da ich für dieses Projekt nur <1>Figma</1> benutzt habe, werde ich auf ein paar Techniken eingehen, welche ich in diesem Design Tool verwendet habe. Unter anderem habe ich gelernt, das Projekt aufzuteilen in sogenannte \"Pages\":</0>",
    "p-6": "In der ersten hielt ich den groben Aufbau fest, sowie alle Texte, welche ich einfügen möchte. In der zweiten befanden sich alle Bilder und Icons, die ich verwenden möchte. Dann fing ich mit der mobilen Version an, da ich so leichter feststellen konnte, welche Elemente essenziell für die Website waren und wie ich sie benutzerfreundlich anordnen konnte.",
    "p-7": "Darauf aufbauend ging das Erstellen der Tablet Version recht schnell. Je nach Komplexität eines Projekts kann es notwendig sein, auch einen Prototyp für die Desktop Version zu erstellen. In diesem Fall aber nicht, da es keine großen Änderungen von Tablet zu Desktop gab.",
    "bullet-points": {
      "bp-3": "Inhalte",
      "bp-4": "Anlagen",
      "bp-5": "Mobile Variante",
      "bp-6": "Tablet Variante"
    }
  },
  "challenges-and-problems": {
    "p-8": "<0><1>Figma</1> ist ein sehr benutzerfreundliches Programm, weshalb ich damit kaum auf Probleme oder Herausforderungen stieß. Am schwierigsten war es, ein Design zu entwerfen, welches einerseits Konventionen aktueller Web Applikationen berücksichtigt, aber auch dem Charakter der ursrpünglichen Website treu bleibt. Aus diesem Grund habe ich mich für ein simples Schwarz / Weiß Design entschieden, da es das beste Kontrastverhältnis bot und dem Stil der Strichmännchen-Zeichnungen einen passenden Rahmen gab.</0>",
    "p-9": "Zudem war es mir wichtig, den Fokus auf die horizontale Bildergallerie zu legen, da diese das Herzstück seiner Arbeit bilden sollte. Außerdem sind die Buttons im Stil des Original Designs gehalten, um dieses in gewisserweise zu ehren."
  },
  "conclusion": {
    "p-10": "<0>Ich hatte nicht nur sehr viel Spaß bei diesem Projekt, sondern auch mein persönliches Ziel erreicht, <1>Figma</1> besser kennenzulernen. Zumindest so weit, dass ich mich sicher genug darin fühlte Entwürfe anzufertigen. Es gibt noch sehr viel Raum für Verbesserung in meinem Workflow, aber je öfter ich es benutzen werde, desto besser werde ich mit diesem Werkzeug umgehen können. Außerdem war es sehr erfrischend mal keinen Code zu schreiben! 😅</0>"
  }
}
